const titles = {
  'protocol-oblast': 'Обласна рада',
  'protocol-rayon': 'Районна рада',
  'protocol-rayon-city': 'Районна в місті рада',
  'protocol-locality': 'Місцева рада',
  'protocol-mayor': 'Місцевий голова'
}

const candidate = {
  name: '',
  value: ''
}

const party = {
  name: '',
  value: '',
  total: '',
  candidates: [
    JSON.parse(JSON.stringify(candidate)),
    JSON.parse(JSON.stringify(candidate)),
    JSON.parse(JSON.stringify(candidate)),
    JSON.parse(JSON.stringify(candidate)),
    JSON.parse(JSON.stringify(candidate))
  ]
}

const headTypes = {
  'міського голови': 'Міський',
  'сільського голови': 'Сільський',
  'селищного голови': 'Селищний'
}

const data = {
  currentPage: 'settings',
  showHint: true,
  electionTypes: [],
  specificTypes: {
    locality: 'above10',
    head: 'міського голови'
  },
  oblast: {
    protocol: [
      {
        id: 'oblast-num-1',
        title: '1) кількість виборчих бюлетенів, одержаних дільничною виборчою комісією',
        helper: 'Зазначається кількість виборчих бюлетенів, одержаних дільничною виборчою комісією, з урахуванням актів (за наявності), зазначених у частинах  одинадцятій, дванадцятій статті 242 Кодексу.',
        value: ''
      },
      {
        id: 'oblast-num-2',
        title: '2) кількість невикористаних виборчих бюлетенів, погашених дільничною виборчою комісією',
        helper: 'Зазначається сумарна кількість невикористаних виборчих бюлетенів:<br/><br/>– які залишилися у членів дільничної виборчої комісії після закінчення голосування;<br/>– при заповненні яких виборець припустився помилки, з урахуванням актів відповідно до частини дванадцятої статті 248 Кодексу;<br/>– до яких внесено зміни без рішення відповідної територіальної виборчої комісії чи внесено зміни, що не відповідають рішенню територіальної виборчої комісії (зіпсовані виборчі бюлетені), з урахуванням актів відповідно до частини чотирнадцятої статті 242 Кодексу.<br/><br/>Невикористані виборчі бюлетені погашаються дільничною виборчою комісією відповідно до частини чотирнадцятої статті 242, частини дванадцятої статті 248 та частини десятої статті 250 Кодексу.',
        value: ''
      },
      {
        id: 'oblast-num-3',
        title: '3) кількість виборців, включених до списку виборців на виборчій дільниці (на момент закінчення голосування)',
        helper: '',
        value: ''
      },
      {
        id: 'oblast-num-4',
        title: '4) кількість виборців, внесених на виборчій дільниці до витягу із списку виборців для голосування за місцем перебування',
        helper: '',
        value: ''
      },
      {
        id: 'oblast-num-5',
        title: '5) кількість виборців, які отримали виборчі бюлетені у приміщенні для голосування',
        helper: '',
        value: ''
      },
      {
        id: 'oblast-num-6',
        title: '6) кількість виборців, які отримали виборчі бюлетені за місцем перебування',
        helper: '',
        value: ''
      },
      {
        id: 'oblast-num-7',
        title: '7) загальна кількість виборців, які отримали виборчі бюлетені',
        helper: '',
        value: ''
      },
      {
        id: 'oblast-num-8',
        title: '8) кількість виборчих бюлетенів, що не підлягають врахуванню',
        helper: 'Не підлягають врахуванню виборчі бюлетені, що знаходилися у виборчих скриньках: <br/>- у яких відсутній контрольний лист;<br/>- переносна скринька, у якій більше виборчих бюлетенів окремо з кожних місцевих виборів, ніж кількість виборців, включених до витягу із списку виборців на виборчій дільниці;<br/>- контрольний лист у скринці визнано недостовірним;<br/>- зазначені на виборчому бюлетені позначення (номер) виборчого округу та/або номер виборчої дільниці не відповідають позначенню (номеру) відповідного виборчого округу та/або номеру виборчої дільниці, на якій проводиться підрахунок голосів.',
        value: ''
      },
      {
        id: 'oblast-num-9',
        title: '9)  кількість виборців, які взяли участь у голосуванні на виборчій дільниці',
        helper: '',
        value: ''
      },
      {
        id: 'oblast-num-10',
        title: '10) кількість виборчих бюлетенів, визнаних недійсними',
        helper: 'Недійсними згідно з частиною двадцять дев’ятою статті 250 Кодексу вважаються виборчі бюлетені, що знаходилися у виборчих скриньках:<br/><br/>а) на яких відсутня печатка цієї дільничної виборчої комісії;<br/>б) до яких не внесено зміни відповідно до частини тринадцятої статті 242 Кодексу або внесено зміни без рішення відповідної територіальної виборчої комісії чи внесені зміни не відповідають рішенню територіальної виборчої комісії; <br/>в) якщо у виборчому бюлетені проставлено позначки навпроти назви декількох місцевих організацій політичних партій;<br/>г) якщо не проставлено жодної позначки біля повної назви місцевої організації політичної партії;<br/>ґ) якщо не відокремлено контрольний талон виборчого бюлетеня;<br/>д) якщо з інших причин неможливо встановити зміст волевиявлення виборця щодо підтримки виборчого списку певної місцевої організації політичної партії.',
        value: ''
      },
      {
        id: 'oblast-num-11',
        title: '11) сумарна кількість голосів виборців, які підтримали територіальні виборчі списки усіх місцевих організацій політичних партій',
        helper: '',
        value: ''
      },
      {
        id: 'oblast-num-12',
        title: '12) кількість голосів виборців, які підтримали територіальний виборчий список від кожної місцевої організації політичної партії:',
        helper: '',
        value: ''
      },
      {
        id: 'oblast-num-13',
        title: '13) кількість голосів виборців, які підтримали весь територіальний виборчий список кандидатів у депутати від кожної місцевої організації політичної партії, не підтримавши окремого кандидата в депутати з цього списку:',
        helper: '',
        value: ''
      },
      {
        id: 'oblast-num-14',
        title: '14) кількість голосів виборців, які підтримали кожного кандидата в депутати, включеного до територіального виборчого списку кандидатів у депутати від кожної місцевої організації політичної партії:',
        helper: '',
        value: ''
      },
    ],
    parties: [],
    errors: {
      'p11empty': [],
      'p12empty': [],
      'p13empty': [],
      'p7+p2=p1': 0,
      'p5+p6=p7': 0,
      'p8=0': 0,
      'p8-p7=p9': 0,
      'p7=p9': 0,
      'p11+p10=p9': 0,
      'sum12=p11': 0,
      'sum13+p14=p12': 0,
      'success1': false
    }
  },
  rayoncity: {
    protocol: [
      {
        id: 'rayoncity-num-1',
        title: '1) кількість виборчих бюлетенів, одержаних дільничною виборчою комісією',
        helper: 'Зазначається кількість виборчих бюлетенів, одержаних дільничною виборчою комісією, з урахуванням актів (за наявності), зазначених у частинах  одинадцятій, дванадцятій статті 242 Кодексу.',
        value: ''
      },
      {
        id: 'rayoncity-num-2',
        title: '2) кількість невикористаних виборчих бюлетенів, погашених дільничною виборчою комісією',
        helper: 'Зазначається сумарна кількість невикористаних виборчих бюлетенів:<br/><br/>– які залишилися у членів дільничної виборчої комісії після закінчення голосування;<br/>– при заповненні яких виборець припустився помилки, з урахуванням актів відповідно до частини дванадцятої статті 248 Кодексу;<br/>– до яких внесено зміни без рішення відповідної територіальної виборчої комісії чи внесено зміни, що не відповідають рішенню територіальної виборчої комісії (зіпсовані виборчі бюлетені), з урахуванням актів відповідно до частини чотирнадцятої статті 242 Кодексу.<br/><br/>Невикористані виборчі бюлетені погашаються дільничною виборчою комісією відповідно до частини чотирнадцятої статті 242, частини дванадцятої статті 248 та частини десятої статті 250 Кодексу.',
        value: ''
      },
      {
        id: 'rayoncity-num-3',
        title: '3) кількість виборців, включених до списку виборців на виборчій дільниці (на момент закінчення голосування)',
        helper: '',
        value: ''
      },
      {
        id: 'rayoncity-num-4',
        title: '4) кількість виборців, внесених на виборчій дільниці до витягу із списку виборців для голосування за місцем перебування',
        helper: '',
        value: ''
      },
      {
        id: 'rayoncity-num-5',
        title: '5) кількість виборців, які отримали виборчі бюлетені у приміщенні для голосування',
        helper: '',
        value: ''
      },
      {
        id: 'rayoncity-num-6',
        title: '6) кількість виборців, які отримали виборчі бюлетені за місцем перебування',
        helper: '',
        value: ''
      },
      {
        id: 'rayoncity-num-7',
        title: '7) загальна кількість виборців, які отримали виборчі бюлетені',
        helper: '',
        value: ''
      },
      {
        id: 'rayoncity-num-8',
        title: '8) кількість виборчих бюлетенів, що не підлягають врахуванню',
        helper: 'Не підлягають врахуванню виборчі бюлетені, що знаходилися у виборчих скриньках: <br/>- у яких відсутній контрольний лист;<br/>- переносна скринька, у якій більше виборчих бюлетенів окремо з кожних місцевих виборів, ніж кількість виборців, включених до витягу із списку виборців на виборчій дільниці;<br/>- контрольний лист у скринці визнано недостовірним;<br/>- зазначені на виборчому бюлетені позначення (номер) виборчого округу та/або номер виборчої дільниці не відповідають позначенню (номеру) відповідного виборчого округу та/або номеру виборчої дільниці, на якій проводиться підрахунок голосів.',
        value: ''
      },
      {
        id: 'rayoncity-num-9',
        title: '9)  кількість виборців, які взяли участь у голосуванні на виборчій дільниці',
        helper: '',
        value: ''
      },
      {
        id: 'rayoncity-num-10',
        title: '10) кількість виборчих бюлетенів, визнаних недійсними',
        helper: 'Недійсними згідно з частиною двадцять дев’ятою статті 250 Кодексу вважаються виборчі бюлетені, що знаходилися у виборчих скриньках:<br/><br/>а) на яких відсутня печатка цієї дільничної виборчої комісії;<br/>б) до яких не внесено зміни відповідно до частини тринадцятої статті 242 Кодексу або внесено зміни без рішення відповідної територіальної виборчої комісії чи внесені зміни не відповідають рішенню територіальної виборчої комісії; <br/>в) якщо у виборчому бюлетені проставлено позначки навпроти назви декількох місцевих організацій політичних партій;<br/>г) якщо не проставлено жодної позначки біля повної назви місцевої організації політичної партії;<br/>ґ) якщо не відокремлено контрольний талон виборчого бюлетеня;<br/>д) якщо з інших причин неможливо встановити зміст волевиявлення виборця щодо підтримки виборчого списку певної місцевої організації політичної партії.',
        value: ''
      },
      {
        id: 'rayoncity-num-11',
        title: '11) сумарна кількість голосів виборців, які підтримали територіальні виборчі списки усіх місцевих організацій політичних партій',
        helper: '',
        value: ''
      },
      {
        id: 'rayoncity-num-12',
        title: '12) кількість голосів виборців, які підтримали територіальний виборчий список від кожної місцевої організації політичної партії:',
        helper: '',
        value: ''
      },
      {
        id: 'rayoncity-num-13',
        title: '13) кількість голосів виборців, які підтримали весь територіальний виборчий список кандидатів у депутати від кожної місцевої організації політичної партії, не підтримавши окремого кандидата в депутати з цього списку:',
        helper: '',
        value: ''
      },
      {
        id: 'rayoncity-num-14',
        title: '14) кількість голосів виборців, які підтримали кожного кандидата в депутати, включеного до територіального виборчого списку кандидатів у депутати від кожної місцевої організації політичної партії:',
        helper: '',
        value: ''
      },
    ],
    parties: [],
    errors: {
      'p11empty': [],
      'p12empty': [],
      'p13empty': [],
      'p7+p2=p1': 0,
      'p5+p6=p7': 0,
      'p8=0': 0,
      'p8-p7=p9': 0,
      'p7=p9': 0,
      'p11+p10=p9': 0,
      'sum12=p11': 0,
      'sum13+p14=p12': 0,
      'success1': false
    }
  },
  rayon: {
    protocol: [
      {
        id: 'rayon-num-1',
        title: '1) кількість виборчих бюлетенів, одержаних дільничною виборчою комісією',
        helper: 'Зазначається кількість виборчих бюлетенів, одержаних дільничною виборчою комісією, з урахуванням актів (за наявності), зазначених у частинах  одинадцятій, дванадцятій статті 242 Кодексу.',
        value: ''
      },
      {
        id: 'rayon-num-2',
        title: '2) кількість невикористаних виборчих бюлетенів, погашених дільничною виборчою комісією',
        helper: 'Зазначається сумарна кількість невикористаних виборчих бюлетенів:<br/><br/>– які залишилися у членів дільничної виборчої комісії після закінчення голосування;<br/>– при заповненні яких виборець припустився помилки, з урахуванням актів відповідно до частини дванадцятої статті 248 Кодексу;<br/>– до яких внесено зміни без рішення відповідної територіальної виборчої комісії чи внесено зміни, що не відповідають рішенню територіальної виборчої комісії (зіпсовані виборчі бюлетені), з урахуванням актів відповідно до частини чотирнадцятої статті 242 Кодексу.<br/><br/>Невикористані виборчі бюлетені погашаються дільничною виборчою комісією відповідно до частини чотирнадцятої статті 242, частини дванадцятої статті 248 та частини десятої статті 250 Кодексу.',
        value: ''
      },
      {
        id: 'rayon-num-3',
        title: '3) кількість виборців, включених до списку виборців на виборчій дільниці (на момент закінчення голосування)',
        helper: '',
        value: ''
      },
      {
        id: 'rayon-num-4',
        title: '4) кількість виборців, внесених на виборчій дільниці до витягу із списку виборців для голосування за місцем перебування',
        helper: '',
        value: ''
      },
      {
        id: 'rayon-num-5',
        title: '5) кількість виборців, які отримали виборчі бюлетені у приміщенні для голосування',
        helper: '',
        value: ''
      },
      {
        id: 'rayon-num-6',
        title: '6) кількість виборців, які отримали виборчі бюлетені за місцем перебування',
        helper: '',
        value: ''
      },
      {
        id: 'rayon-num-7',
        title: '7) загальна кількість виборців, які отримали виборчі бюлетені',
        helper: '',
        value: ''
      },
      {
        id: 'rayon-num-8',
        title: '8) кількість виборчих бюлетенів, що не підлягають врахуванню',
        helper: 'Не підлягають врахуванню виборчі бюлетені, що знаходилися у виборчих скриньках: <br/>- у яких відсутній контрольний лист;<br/>- переносна скринька, у якій більше виборчих бюлетенів окремо з кожних місцевих виборів, ніж кількість виборців, включених до витягу із списку виборців на виборчій дільниці;<br/>- контрольний лист у скринці визнано недостовірним;<br/>- зазначені на виборчому бюлетені позначення (номер) виборчого округу та/або номер виборчої дільниці не відповідають позначенню (номеру) відповідного виборчого округу та/або номеру виборчої дільниці, на якій проводиться підрахунок голосів.',
        value: ''
      },
      {
        id: 'rayon-num-9',
        title: '9)  кількість виборців, які взяли участь у голосуванні на виборчій дільниці',
        helper: '',
        value: ''
      },
      {
        id: 'rayon-num-10',
        title: '10) кількість виборчих бюлетенів, визнаних недійсними',
        helper: 'Недійсними згідно з частиною двадцять дев’ятою статті 250 Кодексу вважаються виборчі бюлетені, що знаходилися у виборчих скриньках:<br/><br/>а) на яких відсутня печатка цієї дільничної виборчої комісії;<br/>б) до яких не внесено зміни відповідно до частини тринадцятої статті 242 Кодексу або внесено зміни без рішення відповідної територіальної виборчої комісії чи внесені зміни не відповідають рішенню територіальної виборчої комісії; <br/>в) якщо у виборчому бюлетені проставлено позначки навпроти назви декількох місцевих організацій політичних партій;<br/>г) якщо не проставлено жодної позначки біля повної назви місцевої організації політичної партії;<br/>ґ) якщо не відокремлено контрольний талон виборчого бюлетеня;<br/>д) якщо з інших причин неможливо встановити зміст волевиявлення виборця щодо підтримки виборчого списку певної місцевої організації політичної партії.',
        value: ''
      },
      {
        id: 'rayon-num-11',
        title: '11) сумарна кількість голосів виборців, які підтримали територіальні виборчі списки усіх місцевих організацій політичних партій',
        helper: '',
        value: ''
      },
      {
        id: 'rayon-num-12',
        title: '12) кількість голосів виборців, які підтримали територіальний виборчий список від кожної місцевої організації політичної партії:',
        helper: '',
        value: ''
      },
      {
        id: 'rayon-num-13',
        title: '13) кількість голосів виборців, які підтримали весь територіальний виборчий список кандидатів у депутати від кожної місцевої організації політичної партії, не підтримавши окремого кандидата в депутати з цього списку:',
        helper: '',
        value: ''
      },
      {
        id: 'rayon-num-14',
        title: '14) кількість голосів виборців, які підтримали кожного кандидата в депутати, включеного до територіального виборчого списку кандидатів у депутати від кожної місцевої організації політичної партії:',
        helper: '',
        value: ''
      },
    ],
    parties: [],
    errors: {
      'p11empty': [],
      'p12empty': [],
      'p13empty': [],
      'p7+p2=p1': 0,
      'p5+p6=p7': 0,
      'p8=0': 0,
      'p8-p7=p9': 0,
      'p7=p9': 0,
      'p11+p10=p9': 0,
      'sum12=p11': 0,
      'sum13+p14=p12': 0,
      'success1': false
    }
  },
  locality: {
    protocol: [
      {
        id: 'locality-num-1',
        title: '1) кількість виборчих бюлетенів, одержаних дільничною виборчою комісією',
        helper: 'Зазначається кількість виборчих бюлетенів, одержаних дільничною виборчою комісією, з урахуванням актів (за наявності), зазначених у частинах  одинадцятій, дванадцятій статті 242 Кодексу.',
        value: ''
      },
      {
        id: 'locality-num-2',
        title: '2) кількість невикористаних виборчих бюлетенів, погашених дільничною виборчою комісією',
        helper: 'Зазначається сумарна кількість невикористаних виборчих бюлетенів:<br/><br/>– які залишилися у членів дільничної виборчої комісії після закінчення голосування;<br/>– при заповненні яких виборець припустився помилки, з урахуванням актів відповідно до частини дванадцятої статті 248 Кодексу;<br/>– до яких внесено зміни без рішення відповідної територіальної виборчої комісії чи внесено зміни, що не відповідають рішенню територіальної виборчої комісії (зіпсовані виборчі бюлетені), з урахуванням актів відповідно до частини чотирнадцятої статті 242 Кодексу.<br/><br/>Невикористані виборчі бюлетені погашаються дільничною виборчою комісією відповідно до частини чотирнадцятої статті 242, частини дванадцятої статті 248 та частини десятої статті 250 Кодексу.',
        value: ''
      },
      {
        id: 'locality-num-3',
        title: '3) кількість виборців, включених до списку виборців на виборчій дільниці (на момент закінчення голосування)',
        helper: '',
        value: ''
      },
      {
        id: 'locality-num-4',
        title: '4) кількість виборців, внесених на виборчій дільниці до витягу із списку виборців для голосування за місцем перебування',
        helper: '',
        value: ''
      },
      {
        id: 'locality-num-5',
        title: '5) кількість виборців, які отримали виборчі бюлетені у приміщенні для голосування',
        helper: '',
        value: ''
      },
      {
        id: 'locality-num-6',
        title: '6) кількість виборців, які отримали виборчі бюлетені за місцем перебування',
        helper: '',
        value: ''
      },
      {
        id: 'locality-num-7',
        title: '7) загальна кількість виборців, які отримали виборчі бюлетені',
        helper: '',
        value: ''
      },
      {
        id: 'locality-num-8',
        title: '8) кількість виборчих бюлетенів, що не підлягають врахуванню',
        helper: 'Не підлягають врахуванню виборчі бюлетені, що знаходилися у виборчих скриньках: <br/>- у яких відсутній контрольний лист;<br/>- переносна скринька, у якій більше виборчих бюлетенів окремо з кожних місцевих виборів, ніж кількість виборців, включених до витягу із списку виборців на виборчій дільниці;<br/>- контрольний лист у скринці визнано недостовірним;<br/>- зазначені на виборчому бюлетені позначення (номер) виборчого округу та/або номер виборчої дільниці не відповідають позначенню (номеру) відповідного виборчого округу та/або номеру виборчої дільниці, на якій проводиться підрахунок голосів.',
        value: ''
      },
      {
        id: 'locality-num-9',
        title: '9)  кількість виборців, які взяли участь у голосуванні на виборчій дільниці',
        helper: '',
        value: ''
      },
      {
        id: 'locality-num-10',
        title: '10) кількість виборчих бюлетенів, визнаних недійсними',
        helper: 'Недійсними згідно з частиною двадцять дев’ятою статті 250 Кодексу вважаються виборчі бюлетені, що знаходилися у виборчих скриньках:<br/><br/>а) на яких відсутня печатка цієї дільничної виборчої комісії;<br/>б) до яких не внесено зміни відповідно до частини тринадцятої статті 242 Кодексу або внесено зміни без рішення відповідної територіальної виборчої комісії чи внесені зміни не відповідають рішенню територіальної виборчої комісії; <br/>в) якщо у виборчому бюлетені проставлено позначки навпроти назви декількох місцевих організацій політичних партій;<br/>г) якщо не проставлено жодної позначки біля повної назви місцевої організації політичної партії;<br/>ґ) якщо не відокремлено контрольний талон виборчого бюлетеня;<br/>д) якщо з інших причин неможливо встановити зміст волевиявлення виборця щодо підтримки виборчого списку певної місцевої організації політичної партії.',
        value: ''
      },
      {
        id: 'locality-num-11',
        title: '11) сумарна кількість голосів виборців, які підтримали територіальні виборчі списки усіх місцевих організацій політичних партій',
        helper: '',
        value: ''
      },
      {
        id: 'locality-num-12',
        title: '12) кількість голосів виборців, які підтримали територіальний виборчий список від кожної місцевої організації політичної партії:',
        helper: '',
        value: ''
      },
      {
        id: 'locality-num-13',
        title: '13) кількість голосів виборців, які підтримали весь територіальний виборчий список кандидатів у депутати від кожної місцевої організації політичної партії, не підтримавши окремого кандидата в депутати з цього списку:',
        helper: '',
        value: ''
      },
      {
        id: 'locality-num-14',
        title: '14) кількість голосів виборців, які підтримали кожного кандидата в депутати, включеного до територіального виборчого списку кандидатів у депутати від кожної місцевої організації політичної партії:',
        helper: '',
        value: ''
      },
    ],
    parties: [],
    errors: {
      'p11empty': [],
      'p12empty': [],
      'p13empty': [],
      'p7+p2=p1': 0,
      'p5+p6=p7': 0,
      'p8=0': 0,
      'p8-p7=p9': 0,
      'p7=p9': 0,
      'p11+p10=p9': 0,
      'sum12=p11': 0,
      'sum13+p14=p12': 0,
      'success1': false
    }
  },
  smallLocality: {
    protocol: [
      {
        id: 'smallLocality-num-1',
        title: '1) кількість виборчих бюлетенів, одержаних дільничною виборчою комісією',
        helper: 'Зазначається кількість виборчих бюлетенів, одержаних дільничною виборчою комісією, з урахуванням актів (за наявності), зазначених у частинах  одинадцятій, дванадцятій статті 242 Кодексу.',
        value: ''
      },
      {
        id: 'smallLocality-num-2',
        title: '2) кількість невикористаних виборчих бюлетенів, погашених дільничною виборчою комісією',
        helper: 'Зазначається сумарна кількість невикористаних виборчих бюлетенів:<br/><br/>– які залишилися у членів дільничної виборчої комісії після закінчення голосування;<br/>– при заповненні яких виборець припустився помилки, з урахуванням актів відповідно до частини дванадцятої статті 248 Кодексу;<br/>– до яких внесено зміни без рішення відповідної територіальної виборчої комісії чи внесено зміни, що не відповідають рішенню територіальної виборчої комісії (зіпсовані виборчі бюлетені), з урахуванням актів відповідно до частини чотирнадцятої статті 242 Кодексу.<br/><br/>Невикористані виборчі бюлетені погашаються дільничною виборчою комісією відповідно до частини чотирнадцятої статті 242, частини дванадцятої статті 248 та частини десятої статті 250 Кодексу.',
        value: ''
      },
      {
        id: 'smallLocality-num-3',
        title: '3) кількість виборців, включених до списку виборців на виборчій дільниці (на момент закінчення голосування)',
        helper: '',
        value: ''
      },
      {
        id: 'smallLocality-num-4',
        title: '4) кількість виборців, внесених на виборчій дільниці до витягу із списку виборців для голосування за місцем перебування',
        helper: '',
        value: ''
      },
      {
        id: 'smallLocality-num-5',
        title: '5) кількість виборців, які отримали виборчі бюлетені у приміщенні для голосування',
        helper: '',
        value: ''
      },
      {
        id: 'smallLocality-num-6',
        title: '6) кількість виборців, які отримали виборчі бюлетені за місцем перебування',
        helper: '',
        value: ''
      },
      {
        id: 'smallLocality-num-7',
        title: '7) загальна кількість виборців, які отримали виборчі бюлетені',
        helper: '',
        value: ''
      },
      {
        id: 'smallLocality-num-8',
        title: '8) кількість виборчих бюлетенів, що не підлягають врахуванню',
        helper: 'Не підлягають врахуванню виборчі бюлетені, що знаходилися у виборчих скриньках: <br/>- у яких відсутній контрольний лист;<br/>- переносна скринька, у якій більше виборчих бюлетенів окремо з кожних місцевих виборів, ніж кількість виборців, включених до витягу із списку виборців на виборчій дільниці;<br/>- контрольний лист у скринці визнано недостовірним;<br/>- зазначені на виборчому бюлетені позначення (номер) виборчого округу та/або номер виборчої дільниці не відповідають позначенню (номеру) відповідного виборчого округу та/або номеру виборчої дільниці, на якій проводиться підрахунок голосів.',
        value: ''
      },
      {
        id: 'smallLocality-num-9',
        title: '9)  кількість виборців, які взяли участь у голосуванні на виборчій дільниці',
        helper: '',
        value: ''
      },
      {
        id: 'smallLocality-num-10',
        title: '10) кількість виборчих бюлетенів, визнаних недійсними',
        helper: 'Недійсними згідно з частиною двадцять дев’ятою статті 250 Кодексу вважаються виборчі бюлетені, що знаходилися у виборчих скриньках:<br/><br/>а) на яких відсутня печатка цієї дільничної виборчої комісії;<br/>б) до яких не внесено зміни відповідно до частини тринадцятої статті 242 Кодексу або внесено зміни без рішення відповідної територіальної виборчої комісії чи внесені зміни не відповідають рішенню територіальної виборчої комісії; <br/>в) якщо у виборчому бюлетені проставлено позначки навпроти назви декількох місцевих організацій політичних партій;<br/>г) якщо не проставлено жодної позначки біля повної назви місцевої організації політичної партії;<br/>ґ) якщо не відокремлено контрольний талон виборчого бюлетеня;<br/>д) якщо з інших причин неможливо встановити зміст волевиявлення виборця щодо підтримки виборчого списку певної місцевої організації політичної партії.',
        value: ''
      },
      {
        id: 'smallLocality-num-11',
        title: '11) кількість голосів виборців, поданих за кожного кандидата в депутати:',
        helper: '',
        value: ''
      },
    ],
    parties: [JSON.parse(JSON.stringify(candidate))],
    errors: {
      'p10empty': [],
      'p11empty': [],
      'p7+p2=p1': 0,
      'p5+p6=p7': 0,
      'p8=0': 0,
      'p8-p7=p9': 0,
      'p7=p9': 0,
      'p11+p10=p9': 0,
      'success1': false
    }
  },
  head: {
    protocol: [
      {
        id: 'head-num-1',
        title: '1) кількість виборчих бюлетенів, одержаних дільничною виборчою комісією',
        helper: 'Зазначається кількість виборчих бюлетенів, одержаних дільничною виборчою комісією, з урахуванням актів (за наявності), зазначених у частинах  одинадцятій, дванадцятій статті 242 Кодексу.',
        value: ''
      },
      {
        id: 'head-num-2',
        title: '2) кількість невикористаних виборчих бюлетенів, погашених дільничною виборчою комісією',
        helper: 'Зазначається сумарна кількість невикористаних виборчих бюлетенів:<br/><br/>– які залишилися у членів дільничної виборчої комісії після закінчення голосування;<br/>– при заповненні яких виборець припустився помилки, з урахуванням актів відповідно до частини дванадцятої статті 248 Кодексу;<br/>– до яких внесено зміни без рішення відповідної територіальної виборчої комісії чи внесено зміни, що не відповідають рішенню територіальної виборчої комісії (зіпсовані виборчі бюлетені), з урахуванням актів відповідно до частини чотирнадцятої статті 242 Кодексу.<br/><br/>Невикористані виборчі бюлетені погашаються дільничною виборчою комісією відповідно до частини чотирнадцятої статті 242, частини дванадцятої статті 248 та частини десятої статті 250 Кодексу.',
        value: ''
      },
      {
        id: 'head-num-3',
        title: '3) кількість виборців, включених до списку виборців на виборчій дільниці (на момент закінчення голосування)',
        helper: '',
        value: ''
      },
      {
        id: 'head-num-4',
        title: '4) кількість виборців, внесених на виборчій дільниці до витягу із списку виборців для голосування за місцем перебування',
        helper: '',
        value: ''
      },
      {
        id: 'head-num-5',
        title: '5) кількість виборців, які отримали виборчі бюлетені у приміщенні для голосування',
        helper: '',
        value: ''
      },
      {
        id: 'head-num-6',
        title: '6) кількість виборців, які отримали виборчі бюлетені за місцем перебування',
        helper: '',
        value: ''
      },
      {
        id: 'head-num-7',
        title: '7) загальна кількість виборців, які отримали виборчі бюлетені',
        helper: '',
        value: ''
      },
      {
        id: 'head-num-8',
        title: '8) кількість виборчих бюлетенів, що не підлягають врахуванню',
        helper: 'Не підлягають врахуванню виборчі бюлетені, що знаходилися у виборчих скриньках: <br/>- у яких відсутній контрольний лист;<br/>- переносна скринька, у якій більше виборчих бюлетенів окремо з кожних місцевих виборів, ніж кількість виборців, включених до витягу із списку виборців на виборчій дільниці;<br/>- контрольний лист у скринці визнано недостовірним;<br/>- зазначені на виборчому бюлетені позначення (номер) виборчого округу та/або номер виборчої дільниці не відповідають позначенню (номеру) відповідного виборчого округу та/або номеру виборчої дільниці, на якій проводиться підрахунок голосів.',
        value: ''
      },
      {
        id: 'head-num-9',
        title: '9)  кількість виборців, які взяли участь у голосуванні на виборчій дільниці',
        helper: '',
        value: ''
      },
      {
        id: 'head-num-10',
        title: '10) кількість виборчих бюлетенів, визнаних недійсними',
        helper: 'Недійсними згідно з частиною двадцять дев’ятою статті 250 Кодексу вважаються виборчі бюлетені, що знаходилися у виборчих скриньках:<br/><br/>а) на яких відсутня печатка цієї дільничної виборчої комісії;<br/>б) до яких не внесено зміни відповідно до частини тринадцятої статті 242 Кодексу або внесено зміни без рішення відповідної територіальної виборчої комісії чи внесені зміни не відповідають рішенню територіальної виборчої комісії; <br/>в) якщо у виборчому бюлетені проставлено позначки навпроти назви декількох місцевих організацій політичних партій;<br/>г) якщо не проставлено жодної позначки біля повної назви місцевої організації політичної партії;<br/>ґ) якщо не відокремлено контрольний талон виборчого бюлетеня;<br/>д) якщо з інших причин неможливо встановити зміст волевиявлення виборця щодо підтримки виборчого списку певної місцевої організації політичної партії.',
        value: ''
      },
      {
        id: 'head-num-11',
        title: '11) кількість голосів виборців, поданих за кожного кандидата на посаду сільського/селищного/міського голови:',
        helper: '',
        value: ''
      }
    ],
    parties: [JSON.parse(JSON.stringify(candidate))],
    errors: {
      'p10empty': [],
      'p11empty': [],
      'p7+p2=p1': 0,
      'p5+p6=p7': 0,
      'p8=0': 0,
      'p8-p7=p9': 0,
      'p7=p9': 0,
      'p11+p10=p9': 0,
      'success1': false
    }
  }
}

Vue.component('customInput', {
  props: {
    id: String,
    text: {
      type: String,
      default: 'Назва пункту'
    },
    hint: {
      type: String,
      default: 'Підказка'
    },
    inputHint: {
      type: String,
      default: ''
    },
    validation: {
      type: String,
      default: 'number'
    },
    type: {
      type: String,
      default: 'number'
    },
    min: {
      type: Number,
      default: 0
    },
    max: Number
  },
  template: '#custom-input',
  data: function () {
    return {}
  },
  computed: {
    errorMessage: () => {
      return 'Simple error'
    }
  },
  methods: {
  }
})

Vue.component('partyList', {
  props: {
    id: String,
    list: {
      type: Array,
      default: []
    },
    name: {
      type: String,
      default: 'обласної ради'
    },
    type: {
      type: String,
      default: 'oblast'
    }
  },
  template: '#party-list',
  data: function () {
    return {}
  },
  computed: {
  },
  methods: {
    addParty: function() {
      this.$dispatch('addParty', this.type)
    },
    removeParty: function(index) {
      this.$dispatch('removeParty', { type: this.type, index })
    },
    setValue: function(event, index) {
      this.$dispatch('setPartyName', { type: this.type, name: event.target.value, index })
    }
  }
})

Vue.component('candidates', {
  props: {
    id: String,
    list: {
      type: Array,
      default: []
    },
    type: {
      type: String,
      default: 'oblast'
    },
    party: Number
  },
  template: '#candidates',
  data: function () {
    return {}
  },
  computed: {
  },
  methods: {
    addCandidate: function() {
      this.$dispatch('addCandidate', { type: this.type, party: this.party })
    },
    removeCandidate: function(index) {
      this.$dispatch('removeCandidate', { type: this.type, index, party: this.party })
    },
    setCandidateName: function(event, index) {
      this.$dispatch('setCandidateName', { type: this.type, name: event.target.value, index, party: this.party })
    },
    enterHook: function(event, index) {
      if (event.key !== 'Enter') return false
      let id = 'party-' + this.type + '-' + this.party + '-' + index
      let nextId = 'party-' + this.type + '-' + this.party + '-' + (index + 1)
      if (index + 1 === this.list.length) {
        if (this.list.length < 12) this.addCandidate()
      }
      setTimeout(() => { $('#' + nextId).focus() }, 0)
      if (index === 11) event.target.blur()
    }
  }
})

Vue.component('major-candidates', {
  props: {
    id: String,
    list: {
      type: Array,
      default: []
    },
    type: {
      type: String,
      default: 'smallLocality'
    },
    party: Number
  },
  template: '#major-candidates',
  data: function () {
    return {}
  },
  computed: {
  },
  methods: {
    addCandidate: function() {
      this.$dispatch('addMajorCandidate', { type: this.type })
    },
    removeCandidate: function(index) {
      this.$dispatch('removeMajorCandidate', { type: this.type, index })
    },
    setCandidateName: function(event, index) {
      this.$dispatch('setMajorCandidateName', { type: this.type, name: event.target.value, index})
    },
    enterHook: function(event, index) {
      let id = 'major-' + this.type + '-' + index
      let nextId = 'major-' + this.type + '-' + (index + 1)
      if (event.key !== 'Enter') return false
      if (index === this.list.length - 1) this.addCandidate()
      event.target.blur()
      setTimeout(() => { $('#' + nextId).focus() }, 0)
    }
  }
})

Vue.component('numeric-field', {
  props: {
    id: String,
    index: Number,
    type: {
      type: String,
      default: 'oblast'
    },
    item: {
      id: '',
      title: '',
      helper: '',
      value: ''
    }
  },
  template: '#numeric-field',
  data: function () {
    return {}
  },
  computed: {
  },
  methods: {
    setValue: function(event, index) {
      let value = event.target.value
      value = value < 0 ? 0 : value
      this.$dispatch('setNumericValue', { type: this.type, value, index})
      this.$dispatch('calculateErrors', { type: this.type })
    },
    enterHook: function(event, nextId) {
      if (event.key !== 'Enter') return false
      setTimeout(() => { 
        let el = document.querySelector('#' + nextId)
        if (!el) {
          event.target.blur()
        } else {
          el.focus()
        }
      }, 0)
    }
  }
})

Vue.component('party-field', {
  props: {
    id: String,
    index: Number,
    type: {
      type: String,
      default: 'oblast'
    },
    listType: {
      type: String,
      default: 'value'
    },
    item: {
      id: '',
      title: '',
      helper: '',
      value: ''
    },
    disabled: Boolean
  },
  template: '#party-field',
  data: function () {
    return {}
  },
  computed: {
  },
  methods: {
    setValue: function(event, index) {
      this.$dispatch('setPartyValue', {
        type: this.type,
        value: event.target.value,
        listType: this.listType,
        index
      })
      this.$dispatch('calculateErrors', { type: this.type })
    },
    enterHook: function(event, nextId) {
      if (event.code !== 'Enter') return false
      let el = document.querySelector('#' + nextId)
      if (!el) {
        event.target.blur()
      } else {
        el.focus()
      }
    }
  }
})

Vue.component('candidate-results', {
  props: {
    id: String,
    index: Number,
    type: {
      type: String,
      default: 'oblast'
    },
    listType: {
      type: String,
      default: 'value'
    },
    item: {
      id: '',
      title: '',
      helper: '',
      value: ''
    },
    disabled: Boolean
  },
  template: '#candidate-results',
  data: function () {
    return {}
  },
  computed: {
    sum: function () {
      let resultArray = this.item.candidates.map(el => parseInt(el.value))
      if (isNaN(resultArray[resultArray.length -1])) return false
      if (resultArray.filter(el => isNaN(el)).length !== 0) return false
      let sum = resultArray.reduce((acc, v) => acc + v, 0)
      return sum
    },
    candidateSum: function () {
      let resultArray = this.item.candidates.map(el => parseInt(el.value))
      if (isNaN(resultArray[resultArray.length -1])) return false
      if (resultArray.filter(el => isNaN(el)).length !== 0) return false
      let difference = parseInt(this.item.value) - this.sum - parseInt(this.item.total)
      if (difference === 0) return 'success'
      return difference
    },
    emptyFields: function () {
      return getNaNIndex(this.item.candidates.map(el => parseInt(el.value)))
    },
    emptyCandidates: function () {
      return this.item.candidates.filter(el => el.name.length).length > 4
    }
  },
  methods: {
    setValue: function(event, index, candidate) {
      this.$dispatch('setPartyCandidateValue', {
        type: this.type,
        value: event.target.value,
        listType: this.listType,
        candidate,
        index
      })
    },
    enterHook: function(event, nextId) {
      if (event.code !== 'Enter') return false
      let el = document.querySelector('#' + nextId + ' input')
      if (!el) {
        event.target.blur()
      } else {
        el.focus()
      }
    }
  }
})

Vue.component('general-protocol-above-10', {
  props: {
    id: String,
    protocolType: Object,
    type: String
  },
  template: '#general-protocol-above-10',
  data: function () {
    return {}
  },
  methods: {
    updateErrors () {
      let type = this.type
      setTimeout(() => { this.$dispatch('calculateErrors', { type }) }, 0)
    },
    deep: true
  }
})

Vue.component('general-protocol-below-10', {
  props: {
    id: String,
    protocolType: Object,
    type: String
  },
  template: '#general-protocol-below-10',
  data: function () {
    return {}
  },
  methods: {
    updateErrors () {
      let type = this.type
      setTimeout(() => { this.$dispatch('calculateErrors', { type }) }, 0)
    },
    deep: true
  }
})
new Vue({
  el: '#app',
  compiled () {
    let oldData = localStorage.getItem('dvk')
    oldData = oldData === null ? JSON.parse(JSON.stringify(data)) : JSON.parse(oldData)
    for (key of Object.keys(oldData)) {
      Vue.set(this, key, oldData[key])
    }
  },
  data: JSON.parse(JSON.stringify(data)),
  computed: {
    'headType': function () {
      return headTypes[this.specificTypes.head]
    },
    'title': function () {
      if (this.currentPage in titles) return titles[this.currentPage]
      return 'ПРОТОКОЛ ДВК' 
    }
  },
  methods: {
    resetData: function () {
      Object.keys(data).forEach(key => {
        Vue.set(this, key, JSON.parse(JSON.stringify(data[key])))
      })
    }
  },
  events: {
    addParty: function (type) {
      this[type].parties.push(JSON.parse(JSON.stringify(party)))
    },
    setPartyName: function (d) {
      this[d.type].parties[d.index].name = d.name
    },
    removeParty: function (d) {
      this[d.type].parties.splice(d.index, 1)
    },
    addCandidate: function (d) {
      this[d.type].parties[d.party].candidates.push(JSON.parse(JSON.stringify(candidate)))
    },
    setCandidateName: function (d) {
      Vue.set(this[d.type].parties[d.party].candidates[d.index], 'name', d.name)
    },
    removeCandidate: function (d) {
      this[d.type].parties[d.party].candidates.splice(d.index, 1)
    },
    addMajorCandidate: function (d) {
      this[d.type].parties.push(JSON.parse(JSON.stringify(candidate)))
    },
    setMajorCandidateName: function (d) {
      Vue.set(this[d.type].parties[d.index], 'name', d.name)
    },
    removeMajorCandidate: function (d) {
      this[d.type].parties.splice(d.index, 1)
    },
    setNumericValue: function (d) {
      Vue.set(this[d.type].protocol[d.index], 'value', d.value)
    },
    setPartyValue: function (d) {
      Vue.set(this[d.type].parties[d.index], d.listType, d.value)
    },
    setPartyCandidateValue: function (d) {
      Vue.set(this[d.type].parties[d.index].candidates[d.candidate], 'value', d.value)
    },
    calculateErrors: function (d) {
      if (!d.type) return false
      let major = ['smallLocality', 'head'].includes(d.type)
      let protocol = JSON.parse(JSON.stringify(this[d.type].protocol))
      protocol.forEach(el => el.value = parseInt(el.value))
      // First error
      if (!isNaN(protocol[0].value) &&
          !isNaN(protocol[1].value) &&
          !isNaN(protocol[6].value)) {
        let difference = protocol[0].value - protocol[1].value - protocol[6].value
        Vue.set(this[d.type].errors, 'p7+p2=p1', difference)
      } else {
        Vue.set(this[d.type].errors, 'p7+p2=p1', 0)        
      }
      // Second error
      if (!isNaN(protocol[4].value) &&
          !isNaN(protocol[5].value) &&
          !isNaN(protocol[6].value)) {
        let difference = protocol[6].value - protocol[5].value - protocol[4].value
        Vue.set(this[d.type].errors, 'p5+p6=p7', difference)
      } else {
        Vue.set(this[d.type].errors, 'p5+p6=p7', 0)        
      }
      // Third error
      if (!isNaN(protocol[7].value)) {
        Vue.set(this[d.type].errors, 'p8=0', protocol[7].value)
      }
      // Fourth error
      if (!isNaN(protocol[6].value) &&
          !isNaN(protocol[7].value) &&
          !isNaN(protocol[8].value)) {
        let difference = protocol[7].value - protocol[8].value - protocol[6].value
        Vue.set(this[d.type].errors, 'p8-p7=p9', difference)
      } else {
        Vue.set(this[d.type].errors, 'p8-p7=p9', 0)        
      }
      // Fifth error
      if (!isNaN(protocol[6].value) &&
          !isNaN(protocol[8].value)) {
        let difference = protocol[6].value - protocol[8].value
        Vue.set(this[d.type].errors, 'p7=p9', difference)
      } else {
        Vue.set(this[d.type].errors, 'p7=p9', 0)
      }

      let partyVotes = this[d.type].parties.map(el => parseInt(el.value))

      // Sixth error
      if (!major) {
        if (!isNaN(protocol[8].value) &&
            !isNaN(protocol[9].value) &&
            !isNaN(protocol[10].value)) {
          let difference = protocol[8].value - protocol[9].value - protocol[10].value
          Vue.set(this[d.type].errors, 'p11+p10=p9', difference)
        } else {
          Vue.set(this[d.type].errors, 'p11+p10=p9', 0)
        }
      } else {
        if (partyVotes.filter(el => isNaN(el)).length === 0 &&
            !isNaN(protocol[8].value && !isNaN(protocol[9].value))) {
          let sum = partyVotes.reduce((acc, val) => acc + val, 0)
          let difference = protocol[8].value - sum - protocol[9].value
          if (difference !== 0) Vue.set(this[d.type].errors, 'p11+p10=p9', difference)
          if (difference === 0) Vue.set(this[d.type].errors, 'p11+p10=p9', 'success')
        } else {
          Vue.set(this[d.type].errors, 'p11+p10=p9', 0)
        }
      }

      if (major) {
        // Empty Fields in p1-10
        let p10empty = getNaNIndex(this[d.type].
          protocol.slice(0, 10).
          map(el => parseInt(el.value)))
        Vue.set(this[d.type].errors, 'p10empty', p10empty)

        // Empty Fields in p12
        let p11empty = getNaNIndex(this[d.type].
          parties.map(el => parseInt(el.value)))
        Vue.set(this[d.type].errors, 'p11empty', p11empty)

        if (this[d.type].errors['p10empty'].length === 0 &&
            (this[d.type].errors['p7+p2=p1'] === 0 || this[d.type].errors['actp7+p2=p1']) &&
            (this[d.type].errors['p5+p6=p7'] === 0 || this[d.type].errors['actp5+p6=p7'])) {
          Vue.set(this[d.type].errors, 'success1', true)
        } else {
          Vue.set(this[d.type].errors, 'success1', false)
        }

      }

      // Seventh error
      if (!major) {
        if (partyVotes.filter(el => isNaN(el)).length === 0 &&
            !isNaN(protocol[10].value)) {
          let sum = partyVotes.reduce((acc, val) => acc + val, 0)
          let difference = protocol[10].value - sum
          if (difference !== 0) Vue.set(this[d.type].errors, 'sum12=p11', difference)
          if (difference === 0) Vue.set(this[d.type].errors, 'sum12=p11', 'success')
        } else {
          Vue.set(this[d.type].errors, 'sum12=p11', 0)
        }

        // Empty Fields in p1-11
        let p11empty = getNaNIndex(this[d.type].
          protocol.slice(0, 11).
          map(el => parseInt(el.value)))
        Vue.set(this[d.type].errors, 'p11empty', p11empty)

        // Empty Fields in p12
        let p12empty = getNaNIndex(this[d.type].
          parties.map(el => parseInt(el.value)))
        Vue.set(this[d.type].errors, 'p12empty', p12empty)

        // Empty Fields in p13
        let p13empty = getNaNIndex(this[d.type].
          parties.map(el => parseInt(el.total)))
        Vue.set(this[d.type].errors, 'p13empty', p13empty)

        // Success
        if (this[d.type].errors['p11empty'].length === 0 &&
            (this[d.type].errors['p7+p2=p1'] === 0 || this[d.type].errors['actp7+p2=p1']) &&
            (this[d.type].errors['p5+p6=p7'] === 0 || this[d.type].errors['actp5+p6=p7']) &&
            (this[d.type].errors['p11+p10=p9'] === 0 || this[d.type].errors['actp11+p10=p9'])) {
          Vue.set(this[d.type].errors, 'success1', true)
        } else {
          Vue.set(this[d.type].errors, 'success1', false)
        }
      }

    },
  },
  watch: {
    '$data': {
      handler(d) {
        localStorage.setItem('dvk', JSON.stringify(d))
      },
      deep: true
    }
  }
})

function focusHandler (e) {
  if (!e.target) return false
  if (!e.target.localName) return false
  if (e.target.localName !== 'input') return false
  if (!e.target.parentElement.classList.contains('focused')) {
    e.target.parentElement.classList.toggle('focused')
  }
}

function blurHandler (e) {
  if (!e.target) return false
  if (!e.target.localName) return false
  if (e.target.localName !== 'input') return false
  if (e.target.parentElement.classList.contains('focused')) {
    e.target.parentElement.classList.toggle('focused')
  }
}

document.body.addEventListener('focus', focusHandler, true)
document.body.addEventListener('blur', blurHandler, true)
document.addEventListener('DOMContentLoaded', () => {
  document.querySelectorAll('input').forEach(el => {
    if (el.parentElement.classList.contains('focused')) {
      el.parentElement.classList.toggle('focused')
    }
  })
})

Vue.transition('fade', {
  enterClass: 'fadeIn',
  leaveClass: 'fadeOut'
})

$(document).ready(function() {
  $("input").focus(function() { $(this).select() } )
})

function getNaNIndex (arr) {
  return arr.reduce((acc, val, i) => {
    if (isNaN(val)) acc.push(i + 1)
    return acc
  }, [])
}